//////////////////////////////////////////////////////
//
//	詳細		：基盤実体クラスメソッド
//	作成者		：岸　将史
//	最終更新日	：2014/04/13
//
//////////////////////////////////////////////////////
#include "BaseEntity.h"


#pragma region 静的メンバ変数
int C_BaseEntity::m_nextID = 0;
#pragma endregion


/*************************************************************************

作成者		：岸　将史
最終更新日	：2014/01/27
用途		：メンバ変数の初期化
第１引数	：－
返却値		：－

*************************************************************************/
C_BaseEntity::C_BaseEntity(int id){
	m_ID = id;		// IDを設定する
	++m_nextID;		// 使用できるIDを更新する
}



/*************************************************************************

作成者		：岸　将史
最終更新日	：2014/01/27
用途		：－
第１引数	：－
返却値		：－

*************************************************************************/
C_BaseEntity::~C_BaseEntity(){
}


#pragma region getアクセサ


/*************************************************************************

作成者		：岸　将史
最終更新日	：2014/01/27
用途		：自身が所持しているIDを取得する
第１引数	：－
返却値		：実体のID

*************************************************************************/
int C_BaseEntity::GetID() const {
	return m_ID;
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2014/04/13
用途		：次に利用できるIDを取得する
第１引数	：－
返却値		：利用可能なID

*************************************************************************/
int C_BaseEntity::GetNextID(){
	return m_nextID;
}


#pragma endregion