//////////////////////////////////////////////////////
//
//	詳細		：エフェクトクラスメソッド
//	作成者		：岸　将史
//	最終更新日	：2013/12/20
//
//////////////////////////////////////////////////////
#include "BaseEffect.h"


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：メンバ変数の初期化を行う
第１引数	：表示するX座標
第２引数	：表示するY座標
第３引数	：オブジェクトが移動する力の大きさ ( デフォルトは0.0f )
第４引数	：オブジェクトの移動方向を弧度法で記入 ( デフォルトは０度(0.0f) )
			　数学と異なり、Y軸は下方向に＋なのでX軸を起点に時計回りで指定
返却値		：－

*************************************************************************/
C_EffectTask::C_EffectTask( float positionX, float positionY, float scalar, float angle, float priority )
	: C_ObjectTask( positionX, positionY, scalar, angle, priority )
	, m_timer( 0 ){
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：－

*************************************************************************/
C_EffectTask::~C_EffectTask(){
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：正常終了→true, 異常検知→false

*************************************************************************/
bool C_EffectTask::Initialize(){
	return true;
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：正常終了→true, 異常検知→false

*************************************************************************/
bool C_EffectTask::Update(){
	// タイマーを回す
	++m_timer;

	return true;
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：－

*************************************************************************/
void C_EffectTask::Draw(){
}