//////////////////////////////////////////////////////
//
//	詳細		：オブジェクトクラスメソッド
//	作成者		：岸　将史
//	最終更新日	：2013/12/24
//
//////////////////////////////////////////////////////
#include "Object.h"


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/24
用途		：メンバ変数の初期化を行う
第１引数	：表示するX座標
第２引数	：表示するY座標
第３引数	：オブジェクトが移動する力の大きさ ( デフォルトは0.0f )
第４引数	：オブジェクトの移動方向を弧度法で記入 ( デフォルトは０度(0.0f) )
			　数学と異なり、Y軸は下方向に＋なのでX軸を起点に時計回りで指定
返却値		：－

*************************************************************************/
C_ObjectTask::C_ObjectTask( float positionX, float positionY, float scalar, float angle, float priority )
	: m_positionX( positionX )
	, m_positionY( positionY )
	, m_priority( priority )
	, m_deadFlag( false ){
	// X座標とY座標それぞれの角度を設定する
	m_speedX = scalar * cos( DirectX::XMConvertToRadians( angle ) );
	m_speedY = scalar * sin( DirectX::XMConvertToRadians( angle ) );
	m_imageWidth = 0;
	m_imageHeight = 0;
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：－

*************************************************************************/
C_ObjectTask::~C_ObjectTask(){
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：消滅フラグを立てるだけの簡単な関数です
第１引数	：－
返却値		：－

*************************************************************************/
void C_ObjectTask::Suicide(){
	m_deadFlag = true;
}


/*††††††††††††††††††††††††††† 以下ゲッター ††††††††††††††††††††††††††††*/


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：オブジェクトのX座標

*************************************************************************/
float C_ObjectTask::GetPositionX() const{
	return m_positionX;
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：オブジェクトのY座標

*************************************************************************/
float C_ObjectTask::GetPositionY() const{
	return m_positionY;
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：オブジェクトの画像の幅

*************************************************************************/
float C_ObjectTask::GetImageWidth() const{
	return m_imageWidth;
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：オブジェクトの画像の高さ

*************************************************************************/
float C_ObjectTask::GetImageHeight() const{
	return m_imageHeight;
}


/*************************************************************************

作成者		：岸　将史
最終更新日	：2013/12/20
用途		：－
第１引数	：－
返却値		：オブジェクトの死亡フラグ

*************************************************************************/
bool C_ObjectTask::IsDead() const{
	return m_deadFlag;
}